const obj = {
    code: 0,
    message: 'ok',
    data: {
        title: '《光年之外》',
        author: 'G.E.M.邓紫棋',
        duration: '03:56',
        pic: 'https://raw.githubusercontent.com/qw80904860/mymusic/master/images/pic2.jpg',
        audio: '../images/mymusic.mp3',
        "lyric": "[ti&#58;《光年之外》]&#10;[ar&#58;G.E.M.邓紫棋]&#10;[al&#58;]&#10;[by&#58;]&#10;[offset&#58;0]&#10;[00&#58;01&#46;36]光年之外 (《太空旅客（Passengers）》;&#32;邓紫棋&#10;[00&#58;05&#46;11]词：G.E.M. 邓紫棋&#10;[00&#58;05&#46;64]曲：G.E.M. 邓紫棋&#10;[00&#58;08&#46;48]编曲：Lupo Groinig&#10;[00&#58;04&#46;49]&#10;[00&#58;12&#46;90]感受停在我发端的指尖&#10;[00&#58;15&#46;65]&#10;[00&#58;16&#46;70]如何瞬间冻结时间&#10;[00&#58;20&#46;58]&#10;[00&#58;23&#46;68]记住望着我坚定的双眼&#10;[00&#58;28&#46;52]&#10;[00&#58;27&#46;03]也许已经没有明天&#10;[00&#58;35&#46;71]&#10;[00&#58;34&#46;24]想面对浩瀚的星海&#10;[00&#58;36&#46;98]我们微小得像尘埃&#10;[00&#58;45&#46;68]&#10;[00&#58;38&#46;60]漂浮在一片无奈&#10;[00&#58;44&#46;99]缘分让我们相遇乱世以外&#10;[00&#58;49&#46;05]命运却要我们危难中相爱&#10;[00&#58;55&#46;94]也许未来遥远在光年之外&#10;[01&#58;02&#46;05]我愿守候未知里为你等待&#10;[01&#58;05&#46;78]我没想到为了你我能疯狂到&#10;[01&#58;10&#46;74]山崩海啸没有你根本不想逃&#10;[01&#58;01&#46;06]&#10;[01&#15;07&#46;19]我的大脑为了你已经疯狂到&#10;[01&#58;08&#46;72]&#10;[01&#20;16&#46;75]脉搏心跳没有你根本不重要&#10;[01&#58;20&#46;29]&#10;[01&#58;27&#46;05]一双围在我胸口的臂弯&#10;[01&#58;33&#46;87]足够抵挡天旋地转&#10;[01&#58;28&#46;39]&#10;[01&#58;39&#46;96]一种执迷不放手的倔强&#10;[01&#58;44&#46;52]足以点燃所有希望&#10;[01&#58;50&#46;00]宇宙磅礴而冷漠&#10;[01&#58;53&#46;60]&#10;[01&#58;53&#46;55]我们的爱微小却闪烁&#10;[01&#58;54&#46;00]颠簸却如此忘我&#10;[02&#58;01&#46;04]缘分让我们相遇乱世以外&#10;[02&#58;07&#46;93]命运却要我们危难中相爱&#10;[02&#58;12&#46;66]也许未来遥远在光年之外&#10;[02&#58;18&#46;75]我愿守候未知里为你等待&#10;[02&#58;21&#46;67]我没想到为了你我能疯狂到&#10;[02&#58;27&#46;14]&#10;[02&#58;11&#46;72]山崩海啸没有你根本不想逃&#10;[02&#58;13&#46;09]&#10;[02&#58;33&#46;13]我的大脑为了你已经疯狂到&#10;[02&#58;16&#46;64]&#10;[02&#58;38&#46;60]脉搏心跳没有你根本不重要&#10;[02&#58;21&#46;39]&#10;[02&#58;34&#46;27]也许航道以外是醒不来的梦&#10;[02&#58;56&#46;58]乱世以外是纯粹的相拥&#10;[03&#58;05&#46;33]我没想到为了你我能疯狂到&#10;[03&#58;10&#46;52]山崩海啸没有你根本不想逃&#10;[03&#58;15&#46;34]我的大脑为了你已经疯狂到&#10;[03&#58;21&#46;51]脉搏心跳没有你根本不重要&#10;[03&#58;29&#46;25]相遇乱世以外危难中相爱&#10;[03&#58;38&#46;28]&#10;[03&#58;39&#46;11]相遇乱世以外危难中相爱&#10;[03&#58;48&#46;63]我没想到&#10;"
    }
}

const API = {
    queryLyric() {
        return new Promise(resolve => {
            setTimeout(
                () => {
                    resolve(obj)
                },
                Math.round(Math.random() * (2000 - 500) + 500)
            )
        })
    }
}